{
  "_name_or_path": "yuvalkirstain/PickScore_v1",
  "architectures": [
    "CLIPModel"
  ],
  "initializer_factor": 1.0,
  "logit_scale_init_value": 2.6592,
  "model_type": "clip",
  "projection_dim": 1024,
  "text_config": {
    "bos_token_id": 0,
    "dropout": 0.0,
    "eos_token_id": 2,
    "hidden_act": "gelu",
    "hidden_size": 1024,
    "intermediate_size": 4096,
    "model_type": "clip_text_model",
    "num_attention_heads": 16,
    "num_hidden_layers": 24,
    "projection_dim": 1024
  },
  "torch_dtype": "float32",
  "transformers_version": "4.40.2",
  "vision_config": {
    "dropout": 0.0,
    "hidden_act": "gelu",
    "hidden_size": 1280,
    "intermediate_size": 5120,
    "model_type": "clip_vision_model",
    "num_attention_heads": 16,
    "num_hidden_layers": 32,
    "patch_size": 14,
    "projection_dim": 1024
  }
}
